app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "quantity", "image_one_file_name", "image_one_content_type", "image_one_file_size", "image_one_updated_at", "out_date", "url_trailer", "created_at", "updated_at", "console_id", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @product = Product.new(params_product)
    if @product.save

SELECT "products".* FROM "products" WHERE "products"."console_id" = $1  [["console_id", 1]]
---
  def pc
    @products = Product.where(console_id: 1)

SELECT "products".* FROM "products" WHERE "products"."console_id" = $1  [["console_id", 2]]
---
  def play4
    @products = Product.where(console_id: 2)

SELECT "products".* FROM "products" WHERE "products"."console_id" = $1  [["console_id", 4]]
---
  def switch
    @products = Product.where(console_id: 4)

SELECT "products".* FROM "products" WHERE "products"."console_id" = $1  [["console_id", 3]]
---
  def xbox_one
    @products = Product.where(console_id: 3)

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_product
    @product = Product.find(params[:id])